## Guided Project #7
#### Analyzing CIA Factbook Data Using SQL

In [21]:
#!pip install ipython-sql
import sqlite3

In [17]:
#!conda install -yc conda-forge ipython-sql
!conda update -n base -yc defaults conda

Collecting package metadata (current_repodata.json): done
Solving environment: done

# All requested packages already installed.

In [35]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

In [37]:
%%sql
SELECT *
    FROM sqlite_master
    WHERE type='table'

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [41]:
%%sql
SELECT * FROM facts LIMIT 5

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

### Summary Statistics

In [43]:
%%sql
SELECT MIN(population), MAX(population), 
    MIN(population_growth), MAX(population_growth)
    FROM facts

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

### Detailing into outliers

#### Max population:

In [44]:
%%sql
SELECT name FROM facts
    WHERE population = (SELECT MAX(population)
                        FROM facts)

 * sqlite:///factbook.db
Done.

[('World',)]

#### Min population:

In [46]:
%%sql
SELECT name FROM facts
    WHERE population = (SELECT MIN(population)
                        FROM facts)

 * sqlite:///factbook.db
Done.

[('Antarctica',)]

### Updated Statistics

In [47]:
%%sql
SELECT MIN(population), MAX(population), 
    MIN(population_growth), MAX(population_growth)
    FROM facts
    WHERE name != 'World'

 * sqlite:///factbook.db
Done.

[(0, 1367485388, 0.0, 4.02)]

In [49]:
%%sql
SELECT AVG(population), AVG(area)
    FROM facts
    WHERE name != 'World'

 * sqlite:///factbook.db
Done.

[(32242666.56846473, 555093.546184739)]

#### Population higher than average, area lower than average

In [51]:
%%sql
SELECT name, population, area FROM facts
    WHERE population > (SELECT AVG(population) FROM facts)
    AND area < (SELECT AVG(area) FROM facts)

 * sqlite:///factbook.db
Done.

[('Bangladesh', 168957745, 148460),
 ('Germany', 80854408, 357022),
 ('Japan', 126919659, 377915),
 ('Philippines', 100998376, 300000),
 ('Thailand', 67976405, 513120),
 ('United Kingdom', 64088222, 243610),
 ('Vietnam', 94348835, 331210)]

#### Most poeople

In [54]:
%%sql
SELECT name, population FROM facts
    WHERE population = (SELECT MAX(population)
                        FROM facts
                        WHERE name != 'World')

 * sqlite:///factbook.db
Done.

[('China', 1367485388)]

#### Highest growth

In [55]:
%%sql 
SELECT name, population_growth FROM facts
    WHERE population_growth = (SELECT MAX(population_growth)
                              FROM facts)

 * sqlite:///factbook.db
Done.

[('South Sudan', 4.02)]

In [56]:
%%sql
SELECT * FROM facts WHERE name='World'

 * sqlite:///factbook.db
Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]